MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EZR32LG330F64R67/mcu.h
/** @} End of group EZR32LG330F64R67_RF_Interface */

// #include "core_cm3.h"     /* Cortex-M3 processor and core peripherals */  // Note: Changed for MikroE implementation.
// #include "system_ezr32lg.h" /* System Header */  // Note: Changed for MikroE implementation.
#include <stdint.h>
#define     __I     volatile const       /*!< Defines 'read only' permissions */
#define     __O     volatile             /*!< Defines 'write only' permissions */
#define     __IO    volatile             /*!< Defines 'read / write' permissions */

/* following defines should be used for structure members */
#define     __IM     volatile const      /*! Defines 'read only' structure member permissions */
#define     __OM     volatile            /*! Defines 'write only' structure member permissions */
#define     __IOM    volatile            /*! Defines 'read / write' structure member permissions */

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} PRS_CH_TypeDef;

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} DMA_CH_TypeDef;

typedef struct {
  __IOM uint32_t CFG;                                /**< Configuration                                      */
  __IOM uint32_t LOOP;                               /**< Loop Counter                                       */
  __IOM uint32_t CTRL;                               /**< Control                                            */
  __IOM uint32_t SRC;                                /**< Source Address                                     */
  __IOM uint32_t DST;                                /**< Destination Address                                */
  __IOM uint32_t LINK;                               /**< Link Address                                       */
  __IOM uint32_t XCTRL;                              /**< Extended Control                                   */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t ILSRC;                              /**< Interleaving Source Address                        */
  uint32_t       RESERVED1[3U];                      /**< Reserved for future use                            */
} LDMA_CH_TypeDef;

/** @} End of group EZR32LG330F64R67_Part */

/***************************************************************************//**
 * @defgroup EZR32LG330F64R67_Peripheral_TypeDefs EZR32LG330F64R67 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 ******************************************************************************/

// #include "ezr32lg_dma_ch.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_dma.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_aes.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_usb_hc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_usb_diep.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_usb_doep.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_usb.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_msc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_emu.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_rmu.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_cmu.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_lesense_st.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_lesense_buf.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_lesense_ch.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_lesense.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_usart.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_timer_cc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_timer.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_acmp.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_leuart.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_rtc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_letimer.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_pcnt.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_i2c.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_gpio_p.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_gpio.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_vcmp.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_prs_ch.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_prs.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_adc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_dac.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_burtc_ret.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_burtc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_wdog.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_etm.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_dma_descriptor.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_devinfo.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_romtable.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_calibrate.h"  // Note: Changed for MikroE implementation.

/** @} End of group EZR32LG330F64R67_Peripheral_TypeDefs */

/***************************************************************************//**
 * @defgroup EZR32LG330F64R67_Peripheral_Base EZR32LG330F64R67 Peripheral Memory Map
 * @{
 ******************************************************************************/

#define DMA_BASE          (0x400C2000UL) /**< DMA base address  */
#define AES_BASE          (0x400E0000UL) /**< AES base address  */
#define USB_BASE          (0x400C4000UL) /**< USB base address  */
#define MSC_BASE          (0x400C0000UL) /**< MSC base address  */
#define EMU_BASE          (0x400C6000UL) /**< EMU base address  */
#define RMU_BASE          (0x400CA000UL) /**< RMU base address  */
#define CMU_BASE          (0x400C8000UL) /**< CMU base address  */
#define LESENSE_BASE      (0x4008C000UL) /**< LESENSE base address  */
#define USARTRF0_BASE     (0x4000C000UL) /**< USARTRF0 base address  */
#define USART1_BASE       (0x4000C400UL) /**< USART1 base address  */
#define USART2_BASE       (0x4000C800UL) /**< USART2 base address  */
#define UART0_BASE        (0x4000E000UL) /**< UART0 base address  */
#define UART1_BASE        (0x4000E400UL) /**< UART1 base address  */
#define TIMER0_BASE       (0x40010000UL) /**< TIMER0 base address  */
#define TIMER1_BASE       (0x40010400UL) /**< TIMER1 base address  */
#define TIMER2_BASE       (0x40010800UL) /**< TIMER2 base address  */
#define TIMER3_BASE       (0x40010C00UL) /**< TIMER3 base address  */
#define ACMP0_BASE        (0x40001000UL) /**< ACMP0 base address  */
#define ACMP1_BASE        (0x40001400UL) /**< ACMP1 base address  */
#define LEUART0_BASE      (0x40084000UL) /**< LEUART0 base address  */
#define LEUART1_BASE      (0x40084400UL) /**< LEUART1 base address  */
#define RTC_BASE          (0x40080000UL) /**< RTC base address  */
#define LETIMER0_BASE     (0x40082000UL) /**< LETIMER0 base address  */
#define PCNT0_BASE        (0x40086000UL) /**< PCNT0 base address  */
#define PCNT1_BASE        (0x40086400UL) /**< PCNT1 base address  */
#define PCNT2_BASE        (0x40086800UL) /**< PCNT2 base address  */
#define I2C0_BASE         (0x4000A000UL) /**< I2C0 base address  */
#define I2C1_BASE         (0x4000A400UL) /**< I2C1 base address  */
#define GPIO_BASE         (0x40006000UL) /**< GPIO base address  */
#define VCMP_BASE         (0x40000000UL) /**< VCMP base address  */
#define PRS_BASE          (0x400CC000UL) /**< PRS base address  */
#define ADC0_BASE         (0x40002000UL) /**< ADC0 base address  */
#define DAC0_BASE         (0x40004000UL) /**< DAC0 base address  */
#define BURTC_BASE        (0x40081000UL) /**< BURTC base address  */
#define WDOG_BASE         (0x40088000UL) /**< WDOG base address  */
#define ETM_BASE          (0xE0041000UL) /**< ETM base address  */
#define CALIBRATE_BASE    (0x0FE08000UL) /**< CALIBRATE base address */
#define DEVINFO_BASE      (0x0FE081A8UL) /**< DEVINFO base address */
#define ROMTABLE_BASE     (0xE00FFFD0UL) /**< ROMTABLE base address */
#define LOCKBITS_BASE     (0x0FE04000UL) /**< Lock-bits page base address */
#define USERDATA_BASE     (0x0FE00000UL) /**< User data page base address */

